app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
def show
	@contact = Contact.find(params[:id])

INSERT INTO "contacts" ("name", "phone", "email", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "テストあ"], ["phone", "テストい"], ["email", "テストう"], ["title", "テストえ"], ["body", "テストお"], ["created_at", "2018-06-12 05:55:25.284542"], ["updated_at", "2018-06-12 05:55:25.284542"]]
---
def create
	contact = Contact.new(contact_params)
	contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 1]]
---
def destroy
	contact = Contact.find(params[:id])
    contact.destroy